//*Задание 1. *Представьте, что вы работаете над разработкой простого приложения для записной книжки,
//которое позволяет пользователям добавлять, редактировать и удалять контакты.
//Ваша задача - придумать как можно больше различных тестов
//        (юнит-тесты, интеграционные тесты, сквозные тесты) для этого приложения.
//Напишите название каждого теста, его тип и краткое описание того, что этот тест проверяет.


//Поизвел бы 1 интеграционный тест, в котором протестировал добавление, редактирование и удаление контактов.


//
//        *Задание 2. *Ниже список тестовых сценариев.
//Ваша задача - определить тип каждого теста (юнит-тест, интеграционный тест, сквозной тест)
//        и объяснить, почему вы так решили.



//        ""Проверка того, что функция addContact корректно добавляет новый контакт в список контактов"".

//юнит-тест, т.к. производится тестирование конкретной функции




//        ""Проверка того, что при добавлении контакта через пользовательский интерфейс,
//контакт корректно отображается в списке контактов"".

//интеграционный тест - для тестирования данного фукционала придется задействовать несколько функций




//        ""Проверка полного цикла работы с контактом: создание контакта,
//редактирование и последующее удаление"".

//сквозной тест, т.к. Проверка полного цикла работы характерна именно для сквозного теста